import { Card, CardDescription, CardTitle } from "@/components/ui/card";
import Image from "next/image";

const news = {
  id: "8678686",
  image: "news.png",
  title:
    "ঝিনাইদহের জামায়াতের নারী নেত্রীদের উপর বিএনপির সন্ত্রাসীদের হামলার ন্যক্কারজনক ঘটনার তীব্র নিন্দা এবং প্রতিবাদ",
  date: "১৭ মার্চ ২০২৫",
  description: `পিপাসু ইসলামী জনতার হৃদয় ব্যাথিত বাংলাদেশ জামায়াতে ইসলামীর সাবেক আমীর, ভাষা সৈনিক, সাবেক ডাকসু জি এস, মজলুম জননেতা অধ্যাপক গোলাম আযম (রহঃ)  তার জীবনের শেষ দিন পর্যন্ত শতভাগ আন্তরিকতা, উদারতা ও দরদ দিয়ে দেশের সকল শীর্ষ আলেম ও পীর মাশায়েখদের সাথে সম্পর্ক রক্ষা করে গেছেন। সবার ঐক্যের চেষ্টায় অনেক অবদান  রেখে গেছেন তিনি সবার সোহবতে যেতেন, আবার সবাই তার সোহবতেও আসতেন তাঁদের অনেকেই দুনিয়া থেকে বিদায় নিয়েছেন আবার কেউ কেউ আজও সে সব ইতিহাসের সাক্ষী হয়ে বেঁচে আছেন অধ্যাপক গোলাম আযম রচিত ‘ইকামাতে দ্বীন’বইতে ইসলাম ও ইসলামী ঐক্যের জন্য তাঁর গভীর আবেগ ও অভিব্যাক্তি এভাবে প্রকাশ করেছেন – আমার পিতা থেকে ইসলামকে একটি ধর্ম বলেই বুঝেছিলাম। হযরত মাওলানা থানভী রহমাতুল্লাহি আলাইহির লেখা থেকে ও মাওলানা শামছুল হক ফরিদপুরী রহমতুল্লাহি আলাইহি এর সোহবতে বুঝতে পারলাম যে, ইসলাম অত্যন্ত যুক্তিপূর্ণ ধর্ম। তাবলীগ জামায়াতের মাধ্যমে অনুভব করলাম যে, ইসলাম এক মহান মিশন এবং এর জন্য জীবন উৎসর্গ করাই ঈমানের দাবি এদেশে তাবলীগ জামায়াতের আমীর হযরত মাওলানা আব্দুল আজিজ (রহঃ) এর সাথে চিল্লা দেবার সুযোগ পাওয়ায় এবং তাবলীগের চিল্লা উপলক্ষে হিন্দুস্তান গিয়ে অনেক যোগ্য আলেম হতে দ্বীনের পথে জীবন উৎসর্গ করার প্রেরণা পাই। সাড়ে চার বছর তাবলীগ জামায়াতের নিয়মিত কাজ করার যে তৌফিক আল্লাহ পাক দিয়েছেন তাতে আমার জীবনে এ জযবা পয়দা হয়েছে যে, ইসলামই মুসলিম জীবনের একমাত্র উদ্দেশ্য হওয়া উচিত জামায়াতে ইসলামীতে এসে অনুধাবন করলাম যে, ইসলাম এমন এক বিপ্লবী আন্দোলন, যার মাধ্যমে আল্লাহর জমিনে আল্লাহর বিধানকে কায়েম করার জন্য চেষ্টা করা মুমিনের জীবনের সবচেয়ে বড় ফরজ

এখন আমি কৃতজ্ঞতার সাথে স্বীকার করছি যে, হযরত থানভী (রহ), তাবলীগ জামায়াত, তমুদ্দুন মজলিস ও জামায়াতে ইসলামী আমাকে ক্রমিক পর্যায়ে সত্যিকারের মুসলিম হবার প্রেরণা দিয়েছে। জামায়াতে ইসলামীতে এসে পূর্ণাঙ্গ ইসলামের রূপ বিস্তারিতভাবে জানবার সুযোগ পেয়েছি

জামায়াতে ইসলামীর বাইরে এমন কয়েকজন বড় আলেমের সাথে আমার সম্পর্ক ছিল, যাদের কাছ থেকে দ্বীনের বিভিন্ন দিক সম্পর্কে আমি যথেষ্ট আলো পেয়েছি। তাঁরা যেহেতু আমাকে স্নেহ করতেন সেহেতু অল্প সময়ে অনেক বেশি ফায়দা তাদের কাছ থেকে হাসিল করার সুযোগ তাঁরা দিতেন।

হযরত মাওলানা শামসুল হক ফরিদপুরী রহিমাহুল্লাহ এর মাধ্যমেই হযরত মাওলানা নূর মোহাম্মদ আজমী রহমাতুল্লাহি আলাইহির মত বড় আলেমের সাথে ঘনিষ্ঠ হওয়ার সৌভাগ্য হয়েছিল।

সকল প্রকার দ্বীনি খিদমত ও সব দ্বীনি সংগঠনের প্রতি শ্রদ্ধাবোধ এবং সবার সম্পর্কে উদার মনোভাব পোষণ করার ব্যাপারে এ দু’জনের মতো এমন বিশালমনা লোক বাংলাদেশে আমি পাইনি`,
};

const user = "গোলাম মোস্তফা কামাল";

export default function page() {
  return (
    <Card className="py-0 shadow-none border-none">
      <CardTitle className="text-2xl md:text-3xl">{news.title}</CardTitle>
      <p className="text-xl">- {user}</p>
      <p className="">{news.date}</p>
      <Image
        className="w-full"
        src={"/news.png"}
        width={400}
        height={300}
        alt={news.title}
      />
      <CardDescription className="text-xl text-justify">
        {news.description}
      </CardDescription>
    </Card>
  );
}
